dfpyme/app/Views/toma_pedidos/offcanva_productos.php

SELECT *
FROM "producto"
ORDER BY "nombreproducto" ASC
---


                    <div class="row " id="canva_producto">
                        <?php $productos = model('productoModel')->orderBy('nombreproducto', 'asc')->findAll();