dfpyme/app/Controllers/Boletas/Boletas.php

        foreach ($datos as $detalle) {
            $sub_array = array();

            $nombre_cliente = model('clientesModel')->select('nombrescliente')->where('nitcliente', $detalle['nit_cliente'])->first();
---
SELECT "nombrescliente"
FROM "cliente"
WHERE "nitcliente" = '222222222222'
 LIMIT 1


            $sub_array[] =  number_format($detalle['total_documento'], 0, ",", ".");
            $sub_array[] = $detalle['saldo'];
            $tipo_documento = model('estadoModel')->select('descripcionestado')->where('idestado', $detalle['id_estado'])->first();
---
SELECT "descripcionestado"
FROM "estado"
WHERE "idestado" = '8'
 LIMIT 1