dfpyme/app/Controllers/pedidos/CerrarVenta.php

SELECT "nombre"
FROM "impresora"
WHERE "id" = '1'
 LIMIT 1
---
    public function cerrar_venta()
    {



        $id_impresora = model('impresionFacturaModel')->select('id_impresora')->first();

        //$datos_empresa = model('empresaModel')->datosEmpresa();

        $nombre_impresora = model('impresorasModel')->select('nombre')->where('id', $id_impresora['id_impresora'])->first();

SELECT "idtipo"
FROM "usuario_sistema"
WHERE "idusuario_sistema" = '6'
 LIMIT 1
---



        $rol = model('usuariosModel')->select('idtipo')->where('idusuario_sistema', $id_usuario)->first();

SELECT "numeroconsecutivo"
FROM "consecutivos"
WHERE "idconsecutivos" = 11
 LIMIT 1
SELECT "alerta_facturacion"
FROM "dian"
WHERE "iddian" = '1'
 LIMIT 1
SELECT "rangofinaldian"
FROM "dian"
WHERE "iddian" = '1'
 LIMIT 1
SELECT "vigencia"
FROM "dian"
WHERE "iddian" = '1'
 LIMIT 1
SELECT "inicialestatica"
FROM "dian"
WHERE "iddian" = '1'
 LIMIT 1
---
            /**
             * Datos dian
             */
            $id_dian = model('consecutivosModel')->select('numeroconsecutivo')->where('idconsecutivos', '6')->first();
            $numero_facturas = model('consecutivosModel')->select('numeroconsecutivo')->where('idconsecutivos', '8')->first();
            $alerta = model('dianModel')->select('alerta_facturacion')->where('iddian', $id_dian['numeroconsecutivo'])->first();
            $rango_final = model('dianModel')->select('rangofinaldian')->where('iddian', $id_dian['numeroconsecutivo'])->first();
            $fecha_dian  = model('dianModel')->select('vigencia')->where('iddian', $id_dian['numeroconsecutivo'])->first();
            $prefijo_factura = model('dianModel')->select('inicialestatica')->where('iddian', $id_dian['numeroconsecutivo'])->first();

SELECT "numeroconsecutivo"
FROM "consecutivos"
WHERE "idconsecutivos" = '8'
 LIMIT 1
---
            }
            if ($estado == 7) {

                $consectivo_remision = model('consecutivosModel')->select('numeroconsecutivo')->where('idconsecutivos', 11)->first();

SELECT "nota_pedido"
FROM "pedido"
WHERE "fk_mesa" = '1'
 LIMIT 1
---
             */

            $valor_total = model('pedidoModel')->select('valor_total')->where('fk_mesa', $id_mesa)->first();
            $observaciones_genereles = model('pedidoModel')->select('nota_pedido')->where('fk_mesa', $id_mesa)->first();

INSERT INTO "factura_propina" ("estado", "valor_propina", "id_factura", "id_apertura", "fecha_y_hora_factura_venta", "fecha", "hora", "id_mesero", "id_mesa") VALUES ('1', '0', 1, '1', '2024-07-01 17:47:40.061300', '2024-07-01 ', '17:47:40', '6', '1')
---
                    'id_mesa' => $id_mesa
                ];

                $propina_factura = model('FacturaPropinaModel')->insert($data);