dfpyme/app/Controllers/pedidos/CerrarVenta.php

        /**
         * Datos dian
         */
        $id_dian = model('consecutivosModel')->select('numeroconsecutivo')->where('idconsecutivos', '6')->first();
        $numero_facturas = model('consecutivosModel')->select('numeroconsecutivo')->where('idconsecutivos', '8')->first();
        $alerta = model('dianModel')->select('alerta_facturacion')->where('iddian', $id_dian['numeroconsecutivo'])->first();
        $rango_final = model('dianModel')->select('rangofinaldian')->where('iddian', $id_dian['numeroconsecutivo'])->first();
        $fecha_dian  = model('dianModel')->select('vigencia')->where('iddian', $id_dian['numeroconsecutivo'])->first();
        $prefijo_factura = model('dianModel')->select('inicialestatica')->where('iddian', $id_dian['numeroconsecutivo'])->first();
---
SELECT "numeroconsecutivo"
FROM "consecutivos"
WHERE "idconsecutivos" = '8'
 LIMIT 1
SELECT "numeroconsecutivo"
FROM "consecutivos"
WHERE "idconsecutivos" = '14'
 LIMIT 1
SELECT "alerta_facturacion"
FROM "dian"
WHERE "iddian" = '1'
 LIMIT 1
SELECT "rangofinaldian"
FROM "dian"
WHERE "iddian" = '1'
 LIMIT 1
SELECT "vigencia"
FROM "dian"
WHERE "iddian" = '1'
 LIMIT 1
SELECT "inicialestatica"
FROM "dian"
WHERE "iddian" = '1'
 LIMIT 1

         */

        $valor_total = model('pedidoModel')->select('valor_total')->where('fk_mesa', $id_mesa)->first();
        $observaciones_genereles = model('pedidoModel')->select('nota_pedido')->where('fk_mesa', $id_mesa)->first();
---
SELECT "nota_pedido"
FROM "pedido"
WHERE "fk_mesa" = '1'
 LIMIT 1

                'id_mesa' => $id_mesa
            ];

            $propina_factura = model('FacturaPropinaModel')->insert($data);
---
INSERT INTO "factura_propina" ("estado", "valor_propina", "id_factura", "id_apertura", "fecha_y_hora_factura_venta", "fecha", "hora", "id_mesero", "id_mesa") VALUES ('7', '0', 28, '2', '2024-04-29 22:11:05.122400', '2024-04-29 ', '22:11:05', '6', '1')