dfpyme/app/Controllers/pedidos/Mesas.php



                $productos_pedido = model('productoPedidoModel')->producto_pedido($numero_pedido['numero_de_pedido']);
                $total_pedido = model('pedidoModel')->select('valor_total')->where('id', $numero_pedido['numero_de_pedido'])->first();
---
SELECT "valor_total"
FROM "pedido"
WHERE "id" = '152'
 LIMIT 1