dfpyme/app/Controllers/pedidos/Mesas.php

         * Datos del producto
         */

        $se_imprime_en_comanda = model('productoModel')->select('se_imprime')->where('codigointernoproducto', $id_producto)->first();

        $codigo_categoria = model('productoModel')->select('codigocategoria')->where('codigointernoproducto', $id_producto)->first();
        $codigo_interno_producto = model('productoModel')->select('codigointernoproducto')->where('codigointernoproducto', $id_producto)->first();
        $valor_unitario = model('productoModel')->select('valorventaproducto')->where('codigointernoproducto', $id_producto)->first();
---
SELECT "codigointernoproducto"
FROM "producto"
WHERE "codigointernoproducto" = '210'
 LIMIT 1
SELECT "codigocategoria"
FROM "producto"
WHERE "codigointernoproducto" = '210'
 LIMIT 1
SELECT "valorventaproducto"
FROM "producto"
WHERE "codigointernoproducto" = '210'
 LIMIT 1

                    'codigointernoproducto' => $codigo_interno_producto,
                    'numero_productos_impresos_en_comanda' => 0
                ];
                $insertar = model('productoPedidoModel')->insert($producto_pedido);
---
INSERT INTO "producto_pedido" ("numero_de_pedido", "cantidad_producto", "nota_producto", "valor_unitario", "impresion_en_comanda", "cantidad_entregada", "valor_total", "se_imprime_en_comanda", "codigo_categoria", "codigointernoproducto", "numero_productos_impresos_en_comanda") VALUES (('623'), 1, '', ('65000'), FALSE, 0, ('65000'), 't', '8', ('210'), 0)

                $model = model('pedidoModel');
                $actualizar = $model->set($pedido);
                $actualizar = $model->where('id', $numero_pedido['id']);
                $actualizar = $model->update();
---
UPDATE "pedido" SET "valor_total" = 65000, "cantidad_de_productos" = 2, "fecha_actualizacion" = '2023-10-09 11:57:19'
WHERE "id" = '623'