dfpyme/app/Controllers/pedidos/Mesas.php

    public function index()
    {
        $categorias = model('categoriasModel')->where('permitir_categoria', 'true')->orderBy('nombrecategoria', 'asc')->findAll();
        $salones = model('salonesModel')->findAll();
        $mesas = model('mesasModel')->where('estado', 0)->orderBy('id', 'ASC')->findAll();
        $estado = model('estadoModel')->orderBy('idestado', 'ASC')->findAll();
        $cliente_dian = model('clientesModel')->where('nitcliente', '222222222222')->first();
        $bancos = model('BancoModel')->findAll();
        $requiere_mesero = model('configuracionPedidoModel')->select('mesero_pedido')->first();
        $meseros = model('usuariosModel')->where('idtipo', 2)->orderBy('nombresusuario_sistema', 'asc')->find();
        $meseros = model('usuariosModel')->where('estadousuario_sistema', true)->orderBy('nombresusuario_sistema', 'asc')->find();
---
SELECT *
FROM "categoria"
WHERE "permitir_categoria" = 'true'
ORDER BY "nombrecategoria" ASC
SELECT *
FROM "estado"
ORDER BY "idestado" ASC
SELECT *
FROM "cliente"
WHERE "nitcliente" = '222222222222'
 LIMIT 1
SELECT *
FROM "usuario_sistema"
WHERE "idtipo" = 2
ORDER BY "nombresusuario_sistema" ASC
SELECT *
FROM "usuario_sistema"
WHERE "estadousuario_sistema" = TRUE
ORDER BY "nombresusuario_sistema" ASC

         * Datos del producto
         */

        $se_imprime_en_comanda = model('productoModel')->select('se_imprime')->where('codigointernoproducto', $id_producto)->first();

        $codigo_categoria = model('productoModel')->select('codigocategoria')->where('codigointernoproducto', $id_producto)->first();
        $codigo_interno_producto = model('productoModel')->select('codigointernoproducto')->where('codigointernoproducto', $id_producto)->first();
        $valor_unitario = model('productoModel')->select('valorventaproducto')->where('codigointernoproducto', $id_producto)->first();
---
SELECT "se_imprime"
FROM "producto"
WHERE "codigointernoproducto" = '283'
 LIMIT 1
SELECT "codigocategoria"
FROM "producto"
WHERE "codigointernoproducto" = '283'
 LIMIT 1
SELECT "codigointernoproducto"
FROM "producto"
WHERE "codigointernoproducto" = '283'
 LIMIT 1
SELECT "valorventaproducto"
FROM "producto"
WHERE "codigointernoproducto" = '283'
 LIMIT 1

                    'codigointernoproducto' => $codigo_interno_producto,
                    'numero_productos_impresos_en_comanda' => 0
                ];
                $insertar = model('productoPedidoModel')->insert($producto_pedido);
---
INSERT INTO "producto_pedido" ("numero_de_pedido", "cantidad_producto", "nota_producto", "valor_unitario", "impresion_en_comanda", "cantidad_entregada", "valor_total", "se_imprime_en_comanda", "codigo_categoria", "codigointernoproducto", "numero_productos_impresos_en_comanda") VALUES (('917'), 1, '', ('22000'), FALSE, 0, ('22000'), 't', '12', ('283'), 0)

                $model = model('pedidoModel');
                $actualizar = $model->set($pedido);
                $actualizar = $model->where('id', $numero_pedido['id']);
                $actualizar = $model->update();
---
UPDATE "pedido" SET "valor_total" = 241000, "cantidad_de_productos" = 11, "fecha_actualizacion" = '2024-06-19 23:22:40'
WHERE "id" = '917'

    function mesas_salon()
    {
        $id_salon = $this->request->getPost('id_salon');
        $categorias = model('categoriasModel')->where('permitir_categoria', 'true')->orderBy('nombrecategoria', 'asc')->findAll();
---
SELECT *
FROM "categoria"
WHERE "permitir_categoria" = 'true'
ORDER BY "nombrecategoria" ASC