dfpyme/app/Controllers/pedidos/PartirFactura.php

SELECT "numeroconsecutivo"
FROM "consecutivos"
WHERE "idconsecutivos" = 48
 LIMIT 1
---
                    $totalBase += $valor['base_ico'] + $valor['base_iva'];
                }
            }
            $maxVenta = model('consecutivosModel')->select('numeroconsecutivo')->where('idconsecutivos', 48)->first();