dfpyme/app/Controllers/producto/operacionesProductoController.php

    function get_codigo_interno()
    {
        $codigo_interno_producto = model('consecutivosModel')->select('numeroconsecutivo')->where('idconsecutivos', 2)->first();
---
SELECT "numeroconsecutivo"
FROM "consecutivos"
WHERE "idconsecutivos" = 2
 LIMIT 1