dfpyme/app/Controllers/producto/productoController.php

SELECT "cantidad_inventario"
FROM "inventario"
WHERE "codigointernoproducto" = '1'
 LIMIT 1
---

        if (!empty($datos)) {
            foreach ($datos as $detalle) {
                $cant = model('inventarioModel')->select('cantidad_inventario')->where('codigointernoproducto', $detalle['codigointernoproducto'])->first();