dfpyme/app/Controllers/consultas_y_reportes/cajaDiariaController.php

SELECT "fecha_y_hora_apertura"
FROM "apertura"
WHERE "id" = '40'
 LIMIT 1
---
    function detalle_movimiento_de_caja()
    {

        $ultimo_apertura = $this->request->getPost('id');

        $estado = "";
        $movimientos = "";
        $fecha_cierre = "";
        $ingresos_efectivo = "";
        $ingresos_transaccion = "";
        $efectivo_cierre = "";
        $transaccion_cierre = "";
        $devoluciones = "";
        $retiros = "";
        $saldo = "";
        $hora_apertura = "";
        $hora_cierre = "";

        $tiene_cierre = model('cierreModel')->select('fecha')->where('idapertura', $ultimo_apertura)->first();
        $fecha_apertura = model('aperturaModel')->select('fecha')->where('id', $ultimo_apertura)->first();
        $valor_apertura = model('aperturaModel')->select('valor')->where('id', $ultimo_apertura)->first();
        $fecha_y_hora_apertura = model('aperturaModel')->select('fecha_y_hora_apertura')->where('id', $ultimo_apertura)->first();

SELECT "fecha"
FROM "cierre"
WHERE "idapertura" = '40'
 LIMIT 1
---
            $fecha_cierr = model('cierreModel')->select('fecha')->where('idapertura', $ultimo_apertura)->first();
            $fecha_cierre = $fecha_cierr['fecha'];

            $fecha_y_hora_cierre = model('cierreModel')->select('fecha_y_hora_cierre')->where('idapertura', $ultimo_apertura)->first();