dfpyme/app/Models/cerrarVentaModel.php



            //Datos del producto
            $codigo_categoria = model('productoModel')->select('codigocategoria')->where('codigointernoproducto', $detalle['codigointernoproducto'])->first();
            $id_tipo_inventario = model('productoModel')->select('id_tipo_inventario')->where('codigointernoproducto', $detalle['codigointernoproducto'])->first();
---
SELECT "codigocategoria"
FROM "producto"
WHERE "codigointernoproducto" = '7'
 LIMIT 1
SELECT "id_tipo_inventario"
FROM "producto"
WHERE "codigointernoproducto" = '7'
 LIMIT 1

                $medida = $id_medida['idvalor_unidad_medida'];
            }

            $precio_costo = model('productoModel')->select('precio_costo')->where('codigointernoproducto', $detalle['codigointernoproducto'])->first();
---
SELECT "precio_costo"
FROM "producto"
WHERE "codigointernoproducto" = '7'
 LIMIT 1


            $actualizar_inventario = $inventario->actualizar_inventario($detalle['codigointernoproducto'], $id_tipo_inventario['id_tipo_inventario'], $detalle['cantidad_producto']);

            $impuesto_saludable = model('productoModel')->select('valor_impuesto_saludable')->where('codigointernoproducto', $detalle['codigointernoproducto'])->first();
            $id_saludable = model('productoModel')->select('id_impuesto_saludable')->where('codigointernoproducto', $detalle['codigointernoproducto'])->first();
---
SELECT "valor_impuesto_saludable"
FROM "producto"
WHERE "codigointernoproducto" = '7'
 LIMIT 1
SELECT "id_impuesto_saludable"
FROM "producto"
WHERE "codigointernoproducto" = '7'
 LIMIT 1

                'valor_impuesto_saludable' => $impuesto_saludable['valor_impuesto_saludable']
            ];

            $insertar = model('productoFacturaVentaModel')->insert($producto_factura_venta);

            $costo = model('productoModel')->select('precio_costo')->where('codigointernoproducto', $detalle['codigointernoproducto'])->first();
---
INSERT INTO "producto_factura_venta" ("numerofactura_venta", "codigointernoproducto", "cantidadproducto_factura_venta", "valorunitarioproducto_factura_venta", "idmedida", "idcolor", "valor_descuento", "valor_recargo", "valor_iva", "retorno", "valor", "costo", "id_factura", "valor_venta_real", "impoconsumo", "total", "valor_ico", "impuesto_al_consumo", "iva", "id_iva", "aplica_ico", "valor_total_producto", "fecha_y_hora_venta", "fecha_venta", "id_categoria", "id_impuesto_saludable", "valor_impuesto_saludable") VALUES (('0-28'), '7', '1', '60000', '3', 0, 0, 0, 0, FALSE, 0, '500', 28, '60000', 0, 60000, '0', 0, 0, '31', 't', '60000', '2024-04-29 22:11:05.122400', '2024-04-29', '2', NULL, '500')
SELECT "precio_costo"
FROM "producto"
WHERE "codigointernoproducto" = '7'
 LIMIT 1

                    'id_pedido'=>$detalle['id']
                ];

                $insertar = model('kardexModel')->insert($data_kardex);
---
INSERT INTO "kardex" ("idcompra", "codigo", "idusuario", "idconcepto", "numerodocumento", "fecha", "hora", "cantidad", "valor", "total", "fecha_y_hora_factura_venta", "id_categoria", "id_apertura", "valor_unitario", "id_factura", "costo", "ico", "iva", "id_estado", "valor_ico", "valor_iva", "aplica_ico", "id_pedido") VALUES (0, '7', '6', 10, ('0-28'), '2024-04-29', '22:11:05', '1', '60000', 60000, '2024-04-29 22:11:05.122400', '2', '2', '60000', 28, 500, 0, 0, '7', '0', 0, 't', '50')

    function actualiar_pedido_consecutivos($numero_pedido, $numero_factura, $consecutivo)
    {
        $num_fact = model('pedidoModel');
        $numero_factura = $num_fact->set($numero_factura);
        $numero_factura = $num_fact->where('id', $numero_pedido);
        $numero_factura = $num_fact->update();

        $model = model('consecutivosModel');
        $numero_factura = $model->set($consecutivo);
        $numero_factura = $model->where('idconsecutivos', 8);
        $numero_factura = $model->update();
---
UPDATE "pedido" SET "numero_factura" = '0-28', "fecha_actualizacion" = '2024-04-29 22:11:05'
WHERE "id" = '34'
UPDATE "consecutivos" SET "numeroconsecutivo" = 29
WHERE "idconsecutivos" = 8