dfpyme/app/Models/facturaVentaModel.php

INSERT INTO "factura_venta" ("numerofactura_venta", "nitcliente", "idusuario_sistema", "idcaja", "idestado", "fecha_factura_venta", "horafactura_venta", "descuentofactura_venta", "fechalimitefactura_venta", "aplica_descuento", "estado", "serie", "id_resolucion_dian", "observaciones_generales", "fk_usuario_mesero", "saldo", "valor_factura", "fk_mesa", "numero_pedido", "fecha_y_hora_factura_venta", "descuento", "propina", "id_apertura") VALUES ('88', '222222222222', '6', 1, '7', '2024-04-29 ', '22:11:05', 0, '2024-04-29 ', FALSE, TRUE, '15', '1', NULL, '6', 0, '60000', '1', '34', '2024-04-29 22:11:05.122400', 0, '0', '2')
---
        ];

        $factura_venta = $this->db->table('factura_venta');
        $factura_venta->insert($data);