dfpyme  (para sacar fiscales)/app/Controllers/consultas_y_reportes/cajaDiariaController.php

SELECT "nombreregimen"
FROM "regimen"
WHERE "idregimen" = '1'
 LIMIT 1
SELECT "nombreciudad"
FROM "ciudad"
WHERE "idciudad" = '317'
 LIMIT 1
SELECT "nombredepartamento"
FROM "departamento"
WHERE "iddepartamento" = '751'
 LIMIT 1
SELECT "fecha_y_hora_apertura"
FROM "apertura"
WHERE "id" = '113'
 LIMIT 1
SELECT "fecha_y_hora_cierre"
FROM "cierre"
WHERE "idapertura" = '113'
 LIMIT 1
---
    function informe_fiscal_desde_caja()
    {



       $id_apertura = $this->request->getPost('id_apertura');

        //$id_apertura = 101;
        $fecha_y_hora_cierre = "";
        $ventas_credito = "";



        $datos_empresa = model('empresaModel')->find();
        $id_regimen = $datos_empresa[0]['idregimen'];
        $regimen = model('regimenModel')->select('nombreregimen')->where('idregimen', $id_regimen)->first();
        $nombre_ciudad = model('ciudadModel')->select('nombreciudad')->where('idciudad', $datos_empresa[0]['idciudad'])->first();
        $nombre_departamento = model('departamentoModel')->select('nombredepartamento')->where('iddepartamento', $datos_empresa[0]['iddepartamento'])->first();

        /**
         * Datos de hora y aperura de la caja que se esta consultando
         * 1. Si la caja no esta cerrada se le asigna la fecha y hora actual
         */
        $fecha_y_hora_apertura = model('aperturaModel')->select('fecha_y_hora_apertura')->where('id', $id_apertura)->first();
        $fecha_cierre = model('cierreModel')->select('fecha_y_hora_cierre')->where('idapertura', $id_apertura)->first();

SELECT "consecutivo"
FROM "caja"
WHERE "numerocaja" = 1
 LIMIT 1
---
            array_push($array_devoluciones_ico, $data_devo_ico);
        }

        $consecutivo_caja = model('cajaModel')->select('consecutivo')->where('numerocaja', 1)->first();