dfpyme/app/Controllers/caja/cajaController.php

SELECT "idcaja", "numerocaja"
FROM "caja"
---
    public function apertura()
    {
        $caja = model('cajaModel')->select('idcaja');
        $caja = model('cajaModel')->select('numerocaja')->find();