dfpyme/app/Libraries/Impuestos.php

    public function calcular_impuestos($codigointerno, $valor_total)
    {


        $resultado = array();
        $base_ico = "";
        $impuesto_ico = "";
        $base_iva = "";
        $impuesto_iva = "";

        //echo $codigointerno."</br>";

        $tiene_ico = model('productoModel')->select('aplica_ico')->where('codigointernoproducto', $codigointerno)->first();
        $id_ico = model('productoModel')->select('id_ico_producto')->where('codigointernoproducto', $codigointerno)->first();
        $valor_ico = model('icoConsumoModel')->select('valor_ico')->where('id_ico', $id_ico['id_ico_producto'])->first();

        $id_iva = model('productoModel')->select('idiva')->where('codigointernoproducto', $codigointerno)->first();
        $valor_iva = model('ivaModel')->select('valoriva')->where('idiva ', $id_iva['idiva'])->first();


        if ($tiene_ico['aplica_ico'] == 't') {
            /* Impuesto ICO */
            $porcentaje_ico = ($valor_ico['valor_ico'] / 100) + 1;
            $base_ico = $valor_total / $porcentaje_ico;
            $impuesto_al_consumo = $valor_total - $base_ico;
            $id_iva = model('productoModel')->select('idiva')->where('codigointernoproducto', $codigointerno)->first();
---
SELECT "aplica_ico"
FROM "producto"
WHERE "codigointernoproducto" = '7'
 LIMIT 1
SELECT "id_ico_producto"
FROM "producto"
WHERE "codigointernoproducto" = '7'
 LIMIT 1
SELECT "idiva"
FROM "producto"
WHERE "codigointernoproducto" = '7'
 LIMIT 1
SELECT "valoriva"
FROM "iva"
WHERE "idiva" = '31'
 LIMIT 1