dfpyme/app/Libraries/Inventario.php

SELECT "cantidad_inventario"
FROM "inventario"
WHERE "codigointernoproducto" = '7'
 LIMIT 1
UPDATE "inventario" SET "cantidad_inventario" = -3
WHERE "codigointernoproducto" = '7'
---
    public function actualizar_inventario($codigointerno, $id_tipo_inventario, $cantidad)
    {


        if ($id_tipo_inventario == 1) {
            $cantidad_inventario = model('inventarioModel')->select('cantidad_inventario')->where('codigointernoproducto', $codigointerno)->first();
            $inventario_final = $cantidad_inventario['cantidad_inventario'] - $cantidad;

            $data = [
                'cantidad_inventario' => $inventario_final,

            ];
            $model = model('inventarioModel');
            $actualizar = $model->set($data);
            $actualizar = $model->where('codigointernoproducto', $codigointerno);
            $actualizar = $model->update();