dfpyme/app/Views/pedidos/mesas.php


        <?= $this->include('layout/header_mesas') ?>

        <?php $id_tipo = model('empresaModel')->select('fk_tipo_empresa')->first() ?>
---
SELECT "fk_tipo_empresa"
FROM "empresa"
 LIMIT 1