dfpyme/app/Views/pedidos/mesas.php

SELECT "fk_tipo_empresa"
FROM "empresa"
 LIMIT 1
---

        <?= $this->include('layout/header_mesas') ?>

        <?php $id_tipo = model('empresaModel')->select('fk_tipo_empresa')->first() ?>