dfpyme/app/Views/pedidos/productos_pedido.php

SELECT "fk_tipo_empresa"
FROM "empresa"
 LIMIT 1
---
    }
</style>

<?php $id_tipo = model('empresaModel')->select('fk_tipo_empresa')->first() ?>