dfpyme/app/Controllers/factura_pos/facturacionConImpuestosController.php

    function modulo_facturacion()
    {
        //$id_factura = 70398;
        $id_factura = $_REQUEST['id_factura'];
        $id_usuario = model('facturaVentaModel')->select('idusuario_sistema')->where('id', $id_factura)->first();
        $nombre_usuario = model('usuariosModel')->select('nombresusuario_sistema')->where('idusuario_sistema', $id_usuario['idusuario_sistema'])->first();

        $movimientos_transaccion = model('facturaformaPagoModel')->valor_pago_transaccion($id_factura);
        $movimientos_efectivo = model('facturaformaPagoModel')->valor_pago_efectivo($id_factura);

        $datos_empresa = model('empresaModel')->datosEmpresa();

        $numero_factura = model('facturaVentaModel')->select('numerofactura_venta')->where('id', $id_factura)->first();


        $numero_factura['numerofactura_venta'];

        $id_registro_dian = model('consecutivosModel')->select('numeroconsecutivo')->Where('idconsecutivos', 6)->first();

        //$prefijo_factura = model('consecutivosModel')->select('numeroconsecutivo')->where('conceptoconsecutivo =', 'FacturaPrefijo')->first();
        $prefijo_factura = model('dianModel')->select('inicialestatica')->where('iddian', $id_registro_dian['numeroconsecutivo'])->first();


        $fecha_factura_venta = model('facturaVentaModel')->select('fecha_factura_venta')->where('id', $id_factura)->first();
        $hora_factura_venta = model('facturaVentaModel')->select('horafactura_venta')->where('id', $id_factura)->first();
        $id_usuario = model('facturaVentaModel')->select('idusuario_sistema')->where('id', $id_factura)->first();

        $imprime_boucher = model('cajaModel')->select('imp_comprobante_transferencia')->where('numerocaja', 1)->first();
---
SELECT "nombresusuario_sistema"
FROM "usuario_sistema"
WHERE "idusuario_sistema" = '6'
 LIMIT 1
SELECT "numerofactura_venta"
FROM "factura_venta"
WHERE "id" = '4'
 LIMIT 1
SELECT "numeroconsecutivo"
FROM "consecutivos"
WHERE "idconsecutivos" = 6
 LIMIT 1
SELECT "inicialestatica"
FROM "dian"
WHERE "iddian" = '1'
 LIMIT 1
SELECT "fecha_factura_venta"
FROM "factura_venta"
WHERE "id" = '4'
 LIMIT 1
SELECT "horafactura_venta"
FROM "factura_venta"
WHERE "id" = '4'
 LIMIT 1
SELECT "imp_comprobante_transferencia"
FROM "caja"
WHERE "numerocaja" = 1
 LIMIT 1