dfpyme/app/Controllers/categoria/categoriaController.php

    public function index()
    {

        $categorias = model('categoriasModel')->select('codigocategoria');
        $categorias = model('categoriasModel')->select('permitir_categoria');
        $categorias = model('categoriasModel')->select('impresora');
        $categorias = model('categoriasModel')->select('subcategoria');
        $categorias = model('categoriasModel')->select('nombrecategoria')->orderBy('codigocategoria', 'asc')->find();
---
SELECT "codigocategoria", "permitir_categoria", "impresora", "nombrecategoria"
FROM "categoria"
ORDER BY "codigocategoria" ASC